[{"title":"突然想起了我还有博客这种东西","date":"2017-08-09T14:23:18.000Z","path":"2017/08/09/20170809/","text":"回想起年初自己说的话，简直是啪啪啪打脸啊，大半年来这个博客写的东西都是些没什么营养的，整天吐槽生活的东西，而且这么久过去了，我连吐槽都懒得写到博客里面了。 今天看到室友在部署博客，突然回想起自己好久都没有更新过了，看了下访问量，果然这个博客并没有被什么人发现或者注意到，应该算是我的一个纯净空间吧。 正式工作一个多月了，前段时间项目赶着上线，连续工作了3周，来不及感伤毕业，就陷入到了工作中，那段时间压力真的很大，做的全是之前没有接触过的东西，但是却要在有限的时间内保质保量的完成，并且会发到外网接受用户的考验。不过我很欣慰的是，虽然开发人员的名单只有两个人，但是我不是一个人在战斗，很感谢兴页哥帮我解决了众多疑难bug，虽然他也看不到，不过我从心底里感谢他。 超惠哥作为我的导师，虽然他不懂我这次所用的技术，但是他还是竭尽所能的帮助我，解决了不少的问题，我们的产品，设计，测试陪着我一起加班到凌晨两点。进入公司正式上线的第一个项目，是那么的让人难忘。 其实这一个多月来发生了很多很多的事情，PRO 7发布，黑客大赛，各种聚餐，身边的同事走了不少，外界对魅族各种唱衰。 其实，无论什么时候，我都不会后悔加入这家公司。人生最幸运的事情莫过于，去到自己喜欢的公司，周围有一群合得来的同事，做着自己喜欢的工作，顺便把钱给挣了。这几年来，我都不知道魅族到底送了我多少东西，还有什么不满足的呢。 外界不看好魅族，但是你都没看到魅族年底发布的手机，有怎么能轻易说出魅族药丸这种话呢。Flyme是魅族的骄傲，我也很荣幸成为其中的一份子，能为别人带来更好的体验，我感到很开心，还是希望自己早日成长起来，做出更多的贡献吧。 先定个小目标，比如写一篇技术博客？？？","tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"来到珠海的半个月","date":"2017-02-26T11:17:58.000Z","path":"2017/02/26/newlife/","text":"离开重庆，已经半个月了，在这边也开始慢慢适应了。 刚进公司的时候，组长发了一个网站的代码给我，让我好好看，好好学，我看了很久，似懂非懂的，也自己学了一些东西。第二周的时候，组长开始给我安排了一些任务，让我写一个Python爬虫去爬去网页，但是我之前都没有学过Python，所以，一脸懵逼，然后也没有完成。后来，我的组长仔仔细细地教了我，他那几十行代码，看上去很简单，但是对我而言，却是那么触不可及。 后来，组长让我去解决网站的一个页面跳转的bug，对于解决bug这种事情，对我而言应该比开发简单很多，结果。。。我花了整整一天时间，知道问题出在哪里，但就是解决不了。最后，我妥协了，跑去问组长，组长一脸嫌弃地说：“这个问题不难啊，如果这个你都让我做的话，那你做什么？”我很无奈，我也觉得这个问题很简单，但不知道为什么，我就是无法获取我想要的值。然后把出问题的地方给他说了。结果组长瞬间反应过来了，找到了其中的一个页面，把几行代码注释掉了，然后bug就解决了。我看到那几行代码，心情很复杂，因为写得太隐秘，实在不好发现，而且代码也不是我写的，但是这也不是发现不了的原因。 周五晚上，组长又给我安排了学习任务，都是我之前没有接触过的，我也不知道自己能不能好好坚持下去，但还是努力吧。 昨天上午，我和一起过来的朋友左杰，从酒店，搬到了租的地方。结果运气不好，正巧碰到珠海最冷的天气，我们俩都准备不足，把我们冷惨了，还好我昨天下午提议去买棉絮，不然我今天肯定感冒了。今天中午准备去吃饭的时候，我发现我的MX5没有多少电了，而PRO5充了一晚上的电，还是满的，所以我就想着把卡上到PRO5上面，而这款机器上面没有卡托，所以我就把MX5的卡托取下来，放到PRO5里面去，结果塞到后面发现塞不进去，就取出来了。谁知道，就是这个举动，把我的移动卡弄坏了，再也没有信号了。 不知道为什么，每年我都会遇到一些麻烦的事情。刚让重庆的朋友问了，客服说可以代办，但是营业厅又说不行。反正异地肯定是不行的。我又找了鱼洞的朋友，让他去我们区最大的营业厅问问，如果那里不行，估计就只有等我回重庆自己去办了，但是这样的话，我那些账号就没办法验证了，不知道又有多少麻烦。。。 我还有一张电信卡，但是我并没有支持电信卡的手机，很烦，很忧伤。记住这一天，又是让我变得更加坚强，让我能更好地过好以后的生活吧。fighting！！！","tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"不一样的元宵节","date":"2017-02-11T14:26:11.000Z","path":"2017/02/11/15th/","text":"鸡年的元宵节，大年十五，我从家乡重庆，来到了这个陌生的城市——珠海。选择今天来到珠海，是巧合，也是我刻意而为之。都说看到十五的月亮的时候，都会特别想家，把元宵节作为我离开家乡的日子，也让以后能够更好地回忆这段南飘的岁月吧。 去年11月份，就有同事陆陆续续地到公司这边来实习了，那时候的自己，还蛮羡慕这些同事，可以这么快就到公司来和大家一起愉快地玩耍。但真真到自己的时候，心情却变得有些复杂了，既有期待，也有不舍。期待这个陌生的城市，陌生的街道，陌生的人，舍不得自己待了20几年的重庆，舍不得那些可爱的朋友。 今天，早早的就被妈妈叫起来洗漱吃饭，临走前，妈妈反复叮嘱我带好东西，到了别忘了给他们报个平安。自从我签了魅族之后，妈妈总是会说别人在外地读书的，都找了重庆的工作，我在重庆读的大学，反倒找了这么远的工作。我知道，她不想我走远了，怕没人照顾我，但她却没有办法阻止我，那种无奈，我都看在眼里。只是，得不到的永远在骚动，被偏爱的都有恃无恐，不出去经历挫折，感受孤独，又如何去平静那颗躁动的心呢。 老爸今天请了半天假，一路送我到机场，陪我办理了托运，拿了机票，找到了登机口。没来过机场的他，带着我在大厅里面转来转去，问我上飞机的整个流程是什么，他能送我到哪里。当我拿着机票过安检的时候，我回头看了一下，老爸还在外面看着我，在人群中，他并不出众，但在我眼中，他是如此的耀眼，我甚至不敢和他对望太久，我怕我真的就舍不得走了。 二十几年来，老爸老妈在一起，经历了很多事情，吃了不少苦，但是从未让我在外面受过委屈。总小到大，他们总是尽力地满足我的需求，把他们能给的最好的条件留给我。这些年来，我的足迹遍布了西南地区，但是他们，却好多年都没有出过重庆了。他们为我做的事情，说个三天三夜都没问题，越回忆，越伤感。。。 手机行业是片红海，而我们只是一个珠海小厂。听同事说最近公司又要裁掉一些人，可能也包括实习生。我还没报到，不想说太多，反正竟然来了，就不是来玩的，不管结局如何，一定要好好地学习，努力地工作，别让自己失望就好。 写到这里，心情终于平静了许多，最后，看两集路飞，开心一下。","tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"发红包啦~~~","date":"2017-01-06T09:10:27.000Z","path":"2017/01/06/redpackets/","text":"2016年11月14日，正在进行实训的我闲来无事，便打开慕课网学习。边学边做，是我的一个习惯，于是便有了这个新年祝福加红包的项目。 这个项目我使用了github开源社区的服务器，理论上加载资源的速度较慢，所以我把所有图片和音频存到了七牛云，公共库使用了bootstrap提供的CDN加速，然后对所有JavaScript和css代码进行了压缩，终于将页面的打开速度控制在了3s左右。不过github服务器不稳定，有时候第一次进去要花10s，我也是一脸懵逼啊。 虽然我以后从事的是前端方面的工作，但是我不得不承认，我的设计能力真的low得一bee。54天时间，36个迭代版本，我可能三分之二的时间都在思考页面该如何做，剩下的三分之一时间用来编码、测试、修改。最后的效果，依然没有我想象中那么好。但是没办法，我的技术还太弱了，还有很多很多需要学习和强化的地方。 这次一共给30位朋友做了适配，每一个人页面都有不同的地方，也算是我的一番心意。在这里提醒大家以下几点： 1.点击新年祝福进入页面，第一次页面加载速度较慢，请耐心等待。 2.登录页面没用数据库，所以不支持回车功能，请老老实实按按钮。 3.这个项目是专门为微信自带浏览器设计的，没做兼容性测试，页面错乱说明你的设备不行。 4.IOS版微信在摇一摇时没有音效（虽然我不说你也不知道），反正这是一个bug，但是懒得去修复了。 5.发的红包是支付宝口令红包，需要大家复制口令到支付宝红包中领取，就是粘贴到图中这个位置。 好啦，领取红包的一些小tips已经说完了，这个项目到今天为止也算是告一段落了，后面可能会进行小规模的改动，但是你应该没什么感觉。 2017年，希望大家在各方面都有所进步哦，我的MarkDown语法还没怎么学，所以这个博客大部分都是字，哈哈哈~刚开始写的东西总会被以后的自己嘲笑的。 祝大家新年快乐，么么哒！ 华丽的分割线 今天是2017年1月9号，微信小程序公测的日子。没错，我又更新了我的项目。为了让这个项目能够更加有趣一点，让朋友们能够稍微互动一下。 所以我在项目中插入了两个小彩蛋，只要发现了其中一个彩蛋并且告知我的，就有机会获得我的额外奖励（又给自己增加了不少的成本，哈哈哈~），限量10个名额，先到先得哦! 照片加入了点击放大一丢丢的功能，为了整个界面的良好体验，所以我禁止了用手放大的功能，技术不行，很多地方只能妥协啦。 一个小小的改动，又变了几十个页面，几百行代码，只希望这个页面真的有变得有趣吧。 望喜欢…","tags":[{"name":"红包","slug":"红包","permalink":"http://yoursite.com/tags/红包/"}]},{"title":"新的一年，新的开始","date":"2017-01-01T12:46:14.000Z","path":"2017/01/01/new-start/","text":"唯一永远不改变，是不停的改变。 曾几何时，我还热衷于QQ空间，经常去转发一些搞笑的日志到自己空间中，每年自己也要写几篇日志吐槽吐槽，屁大点事情也要发一个说说，什么照片都往空间上传。 后来，很多转发的日志都被我删了，也懒得再写；说说也少发了，每次尽量说明白点，配张图，免得以后看不懂；图片还是舍不得删，就修改了权限，只对自己可见。慢慢的，微博变成了我转发抽奖信息的，QQ空间变成了我秀图片的，唯一的一片净土，微信，也慢慢被家人侵占了。于是，有了这个博客。 拥有一个属于自己的个人博客，应该是每个程序猿都想做的事情，我也算是在2017年的开头，做出了一个改变。 万事开头难，然后中间难，最后结尾难。 这个博客的功能还太少，还需要自己慢慢来完善。 2016，我很幸运；2017，我希望能用我的努力，让自己一直幸运下去。","tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]}]